saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
<?xml version="1.0" encoding="UTF-8"?>

<package schemaVersion="1.4" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>Keil</vendor>
  <name>STM32H7xx_DFP</name>
  <description>STMicroelectronics STM32H7 Series Device Support and Examples</description>
  <url>http://www.keil.com/pack</url>

  <releases>
    <release version="2.2.0" date="2018-09-04">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.3.0.
      - Updated HAL to version V1.3.0.
      Added device support for subfamily STM32H750.
      CMSIS Driver:
      - USB Device: Corrected transmitted count for non-control IN endpoints
    </release>
    <release version="2.1.0" date="2018-05-09">
      Updated Pack to STM32Cube_FW_H7 Firmware Package version V1.21.0.
      Reworked debug description and debug config files.
      Updated device documentation.
      CMSIS-Driver:
      - CAN:
      -- Changed FDCAN_ECR_TREC_.. to FDCAN_ECR_REC_.. to align with updated device header.
      -- Corrected SetBitrate function.
      - SPI: Corrected Slave select handling.
      - USART: Corrected UARTx/USARTx related typing mistakes.
      - I2C: master clock frequency generation corrected.
      Board Support:
      - STM32H743I_EVAL:
      -- Updated LCDConf.c for STM32H743I_EVAL.
      Board Examples:
      - Validated using STM32CubeMX version 4.25.0 and STM32Cube_FW_H7 version 1.2.0.
      - Updated Abstract.txt in examples reflecting Debug/Release targets.
      - Changed Compiler optimization level to "level 1" for Debug target in all examples.
      - Updated emWin examples to emWin V5.46e.
      - Added Event Recorder to the USB Device and Host examples.
      - Added SNMP_Agent Example.
      - Updated SMTP_Client example.
    </release>

    <release version="2.0.0" date="2017-10-02">
      This DFP requires STM32CubeMX V4.22.1 and STM32Cube_FW_H7 V1.1.0 or higher to be installed.
      New projects require the component 'Device:STM32Cube Framework:STM32CubeMX' for configuration of pins and clocks.
      Updated documentation for STM32Cube Framework usage.
      Added CMSIS-Driver:
      - CAN
      - ETH
      - I2C
      - MCI
      - SPI
      - UART/USART
      - USB Host / Device (no RTOS dependency)
      Added example projects for STM32H743I EVAL Board:
      - all projects have two targets 'debug' and 'release' and require CMSIS-RTOS2
      - Blinky
      - CAN
      - emWin
      - FileSystem
      - Network
      - USB
    </release>

    <release version="1.0.1" date="2017-08-03">
      fixed location specified in debugvars configfile attribute
    </release>

    <release version="1.0.0" date="2017-06-01">
      Initial release of STM32H7 Device Family Pack.
      Based on STM32Cube_FW_H7 Firmware Package version V1.0.0 (2017-04-30)
      Board Support for STM32H743I-EVAL Board:
      - CMSIS-RTOS2 Blinky
      - Fractal Demo
    </release>
  </releases>

  <keywords>                                                                  <!-- keywords for indexing -->
    <keyword>ST</keyword>
    <keyword>Device Support</keyword>
    <keyword>Device Family Package STMicroelectronics</keyword>
    <keyword>STM32H7</keyword>
    <keyword>STM32H7xx</keyword>
  </keywords>

  <devices>
    <family Dfamily="STM32H7 Series" Dvendor="STMicroelectronics:13">
      <processor Dcore="Cortex-M7" DcoreVersion="r0p1" Dclock="400000000" Dmpu="MPU" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <!--book name="Documentation/?.pdf" title="STM32H7xx HAL Drivers"/-->
      <book name="Documentation/DUI0646B_cortex_m7_dgug.pdf" title="Cortex-M7 Generic User Guide"/>

      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G.FLM"      start="0x90000000" size="0x04000000" RAMstart="0x20000000" RAMsize="0x1000" default="0" />
      <algorithm name="CMSIS/Flash/STM32H7xx_MT25TL01G_DUAL.FLM" start="0x90000000" size="0x08000000" RAMstart="0x20000000" RAMsize="0x1000" default="0" />
      <algorithm name="CMSIS/Flash/STM32H743I-eval_FMC.FLM"      start="0x60000000" size="0x01000000" RAMstart="0x20000000" RAMsize="0x1000" default="0" />

      <description>
The STM32H7 devices are based on the high-performance ARM Cortex-M7 32-bit RISC core operating at up to 400 MHz frequency.
The Cortex-M7 core features a floating point unit (FPU) which supports ARM double-precision (IEEE 754 compliant) and single-precision data-processing instructions and data types.
The STM32H7 support a full set of DSP instructions and a memory protection unit (MPU) which enhances application security
      </description>

      <debugvars configfile="CMSIS/Debug/STM32H7x3.dbgconf" version="1.0.0">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var DbgMCU_CR         = 0x00000000;   // DBGMCU_CR:         DBGMCU configuration register
        __var DbgMCU_D1APB1_Fz  = 0x00000000;   // DBGMCU_D1APB1FZ1:  DBGMCU D1APB1 peripheral freeze register
        __var DbgMCU_D2APB1L_Fz = 0x00000000;   // DBGMCU_D2APB1LFZ1: DBGMCU D2APB1L peripheral freeze register
        __var DbgMCU_D2APB1H_Fz = 0x00000000;   // DBGMCU_D2APB1HFZ1: DBGMCU D2APB1H peripheral freeze register
        __var DbgMCU_D2APB2_Fz  = 0x00000000;   // DBGMCU_D2APB2FZ1:  DBGMCU D2APB2 peripheral freeze register
        __var DbgMCU_D3APB4_Fz  = 0x00000000;   // DBGMCU_D3APB4FZ1:  DBGMCU D3APB4 peripheral freeze register

        __var TraceClk_Pin      = 0x00040002;   // PE2
        __var TraceD0_Pin       = 0x00040003;   // PE3
        __var TraceD1_Pin       = 0x00040004;   // PE4
        __var TraceD2_Pin       = 0x00040005;   // PE5
        __var TraceD3_Pin       = 0x00040006;   // PE6
      </debugvars>

      <sequences>
        <!-- Override for Pre-Defined Sequences -->
        <sequence name="DebugDeviceUnlock">
          <block>
            __var value = 0;

            Sequence("CheckID");

            __ap   = 2;                                                                    // Switch to System Debug Access Port

            value  = Read32(0xE00E1004);     // Read DBGMCU_CR
            value |= 0x00670000;             // DBGMCU_CR[16] : CKDBGD1EN
                                             // DBGMCU_CR[17] : CKDBGD2EN
                                             // DBGMCU_CR[18] : CKDBGD3EN
                                             // DBGMCU_CR[21] : D1DBGCLKEN
                                             // DBGMCU_CR[22] : D3DBGCLKEN
          </block>

