saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
          <control if="__traceout"> <!-- Enable Trace Clock and hence access to global trace components now -->
            <block>
              value |= 0x00100000;                                                         // DBGMCU_CR[20] : set TraceClkEn
            </block>
          </control>

          <block>
            Write32(0xE00E1004, value);                                                    // Update DBGMCU_CR
          </block>

          <block info="DbgMCU registers">
            value      = Read32(0xE00E1004); // Read DBGMCU_CR
            value &amp;= 0x00770000;         // keep preset bits
            Write32(0xE00E1004 , DbgMCU_CR         | value);                               // DBGMCU_CR:         Configure MCU Debug
            Write32(0xE00E1034 , DbgMCU_D1APB1_Fz         );                               // DBGMCU_D1APB1FZ1:  Configure D1APB1 peripheral freeze behavior
            Write32(0xE00E103C , DbgMCU_D2APB1L_Fz        );                               // DBGMCU_D2APB1LFZ1: Configure D2APB1L peripheral freeze behavior
            Write32(0xE00E1044 , DbgMCU_D2APB1H_Fz        );                               // DBGMCU_D2APB1HFZ1: Configure D2APB1H peripheral freeze behavior
            Write32(0xE00E104C , DbgMCU_D2APB2_Fz         );                               // DBGMCU_D2APB2FZ1:  Configure D2APB2 peripheral freeze behavior
            Write32(0xE00E1054 , DbgMCU_D3APB4_Fz         );                               // DBGMCU_D3APB4FZ1:  Configure D3APB4 peripheral freeze behavior
          </block>
        </sequence>

        <sequence name="TraceStart">
          <block>
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                               // SWO (asynchronous) Trace Selected?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                               // TPIU (synchronous) Trace Selected?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("EnableTraceSWO");                                                  // Call SWO Trace Setup
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("EnableTraceTPIU");                                                 // Call TPIU Trace Setup
            </block>
          </control>
        </sequence>

        <sequence name="TraceStop">
          <block>
            // Nothing required for SWO Trace
            __var traceSWO    = (__traceout &amp; 0x1) != 0;                               // SWO enabled?
            __var traceTPIU   = (__traceout &amp; 0x2) != 0;                               // Synchronous trace port enabled?
          </block>

          <control if="traceSWO">
            <block>
              Sequence("DisableTraceSWO");
            </block>
          </control>

          <control if="traceTPIU">
            <block>
              Sequence("DisableTraceTPIU");
            </block>
          </control>
        </sequence>

        <!-- User-Defined Sequences -->
        <sequence name="CheckID">
          <block>
            __var pidr1 = 0;
            __var pidr2 = 0;
            __var jep106id = 0;
            __var ROMTableBase = 0;

            __ap = 0;      // AHB-AP

            ROMTableBase = ReadAP(0xF8) &amp; ~0x3;

            pidr1 = Read32(ROMTableBase + 0x0FE4);
            pidr2 = Read32(ROMTableBase + 0x0FE8);
            jep106id = ((pidr2 &amp; 0x7) &lt;&lt; 4 ) | ((pidr1 &gt;&gt; 4) &amp; 0xF);
          </block>

          <control if="jep106id != 0x20">
            <block>
              Query(0, "Not a genuine ST Device! Abort connection", 1);
              Message(2, "Not a genuine ST Device! Abort connection.");
            </block>
          </control>
        </sequence>

        <sequence name="EnableTraceSWO">
          <block>
            __var value = 0;

            Sequence("ConfigureTraceSWOPin");

            __ap   = 2;                                                                    // Switch to System Debug Access Port

            // Enable Trace Clock
            // not necessary because already done in "DebugDeviceUnlock".

            // Configure SWO Funnel (SWTF) at 0xE00E4000
            value      =  Read32(0xE00E4000);                                              // Read Trace Funnel CONTROL Register
            value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings,
            value     |=  0x00000001;                                                      // Enable ITM slave ports
            Write32(0xE00E4000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="DisableTraceSWO">
          <block>
            __var value = 0;

            __ap   = 2;                                                                    // Switch to System Debug Access Port

            // Disable Trace Clock
            value      =  Read32(0xE00E1004);                                              // Read DBGMCU_CR
            value &amp;= ~0x00100000;                                                      // DBGMCU_CR[20] : set TraceClkEn
            Write32(0xE00E1004, value);                                                    // Update DBGMCU_CR

            // Configure SWO Funnel (SWTF) at 0xE00E4000
            value      =  Read32(0xE00E4000);                                              // Read Trace Funnel CONTROL Register
            value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings, disable active slave ports
            Write32(0xE00E4000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="EnableTraceTPIU">
          <block>
            __var value = 0;

            Sequence("ConfigureTraceTPIUPins");

            __ap   = 2;                                                                    // Switch to System Debug Access Port

            // Enable Trace Clock
            // not necessary because already done in "DebugDeviceUnlock".

            // Configure CoreSight Trace Funnel (CSTF) at 0xE00F3000
            value      =  Read32(0xE00F3000);                                              // Read Trace Funnel CONTROL Register
            value &amp;=  0x00000F00;                                                      // Preserve Hold Time Settings
            value     |=  0x00000003;                                                      // Enable ITM and ETM slave ports
            Write32(0xE00F3000, value);                                                    // Update Trace Funnel CONTROL Register
          </block>
        </sequence>

        <sequence name="DisableTraceTPIU">
          <block>
            __var value = 0;

            __ap   = 2;                                                                    // Switch to System Debug Access Port

