saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
        <!-- *************************  Device 'STM32H743ZI'  ***************************** -->
        <device Dname="STM32H743ZI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H743ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743AI'  ***************************** -->
        <device Dname="STM32H743AI">
          <memory    id="IRAM1"                           start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory    id="IRAM2"                           start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory    id="IROM1"                           start="0x08000000" size="0x00200000" startup="1" default="1"/>	
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H743AIIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743II'  ***************************** -->
        <device Dname="STM32H743II">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H743IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32H743IIKx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743BI'  ***************************** -->
        <device Dname="STM32H743BI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H743BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743XI'  ***************************** -->
        <device Dname="STM32H743XI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H743XIHx"> <feature type="BGA" n="240"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743AG'  ***************************** -->
        <device Dname="STM32H743AG">
          <memory                      id="IRAM1"         start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory                      id="IRAM2"         start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory                      id="IROM1"         start="0x08000000" size="0x00100000" startup="1" default="1"/>	
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32H743AGIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H743VG'  ***************************** -->
        <device Dname="STM32H743VG">
          <memory                      id="IRAM1"         start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory                      id="IRAM2"         start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory                      id="IROM1"         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32H743VGHx"> <feature type="BGA" n="100"/> </variant>
        </device>		
      </subFamily>

      <!-- ************************  Subfamily 'STM32H753'  **************************** -->
      <subFamily DsubFamily="STM32H753">
        <debug svd="CMSIS/SVD/STM32H7x3.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H753xx"/>
        <book name="Documentation/DM00314099.pdf" title="STM32H743/753 and STM32H750 Reference Manual"/>
        <book name="Documentation/DM00388325.pdf" title="STM32H753 Data Sheet"/>

        <!-- *************************  Device 'STM32H753VI'  ***************************** -->
        <device Dname="STM32H753VI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

