saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
          <variant Dvariant="STM32H753VITx"> <feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753ZI'  ***************************** -->
        <device Dname="STM32H753ZI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H753ZITx"> <feature type="QFP" n="144"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753II'  ***************************** -->
        <device Dname="STM32H753II">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H753IITx"> <feature type="QFP" n="176"/> </variant>
          <variant Dvariant="STM32H753IIKx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753AI'  ***************************** -->
        <device Dname="STM32H753AI">
          <memory                     id="IRAM1"         start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory                     id="IRAM2"         start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory                     id="IROM1"         start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H753AIIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753BI'  ***************************** -->
        <device Dname="STM32H753BI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H753BITx"> <feature type="QFP" n="208"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753XI'  ***************************** -->
        <device Dname="STM32H753XI">
          <memory id="IRAM1"                              start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory id="IRAM2"                              start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory id="IROM1"                              start="0x08000000" size="0x00200000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00200000"             default="1"/>

          <variant Dvariant="STM32H753XIXx"> <feature type="QFP" n="240"/> </variant>
          <variant Dvariant="STM32H753XIHx"> <feature type="BGA" n="240"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753AG'  ***************************** -->
        <device Dname="STM32H753AG">
          <memory                      id="IRAM1"         start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory                      id="IRAM2"         start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory                      id="IROM1"         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00100000"             default="1"/>

          <variant Dvariant="STM32H753AGIx"> <feature type="BGA" n="169"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H753VG'  ***************************** -->
        <device Dname="STM32H753VG">
          <memory                      id="IRAM1"         start="0x20000000" size="0x00020000" init="0"    default="1"/>
          <memory                      id="IRAM2"         start="0x24000000" size="0x00080000" init="0"    default="1"/>
          <memory                      id="IROM1"         start="0x08000000" size="0x00100000" startup="1" default="1"/>
          <algorithm name="CMSIS/Flash/STM32H7x_2048.FLM" start="0x08000000" size="0x00100000"             default="1"/>
          
          <variant Dvariant="STM32H753VGHx"> <feature type="BGA" n="100"/> </variant>		  
        </device>
      </subFamily>

      <!-- ************************  Subfamily 'STM32H750'  ROMLess  ****************** -->
      <subFamily DsubFamily="STM32H750">
        <debug svd="CMSIS/SVD/STM32H750x.svd"/>
        <compile header="Drivers/CMSIS/Device/ST/STM32H7xx/Include/stm32h7xx.h" define="STM32H750xx"/>
        <book name="Documentation/DM00314099.pdf" title="STM32H743/753 and STM32H750 Reference Manual"/>
        <book name="Documentation/stm32h750ib.pdf" title="STM32H750 Data Sheet"/>

        <!-- *************************  Device 'STM32H750VB' ***************************** -->
        <device Dname="STM32H750VB">
          <memory    name="DTCMRAM"    id="IRAM1"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="RAM_D1"     id="IRAM2"         start="0x24000000" size="0x00080000" default="1" init="0"/>
          <memory    name="RAM_D2"                        start="0x30000000" size="0x00048000" default="1" init="0"/>
          <memory    name="RAM_D3"                        start="0x38000000" size="0x00010000" default="1" init="0"/>
          <memory    name="ITCMRAM"                       start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="FLASH"      id="IROM1"         start="0x08000000" size="0x00020000" default="1" startup="1"/>     <!-- Same as STM32H753VITx + ROMLess -->
          <algorithm name="CMSIS/Flash/STM32H7x_128k.FLM" start="0x08000000" size="0x00020000" default="1"/>

          <variant Dvariant="STM32H750VBTx"><feature type="QFP" n="100"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H750IB' ***************************** -->
        <device Dname="STM32H750IB">
          <memory    name="DTCMRAM"    id="IRAM1"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="RAM_D1"     id="IRAM2"         start="0x24000000" size="0x00080000" default="1" init="0"/>
          <memory    name="RAM_D2"                        start="0x30000000" size="0x00048000" default="1" init="0"/>
          <memory    name="RAM_D3"                        start="0x38000000" size="0x00010000" default="1" init="0"/>
          <memory    name="ITCMRAM"                       start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="FLASH"      id="IROM1"         start="0x08000000" size="0x00020000" default="1" startup="1"/>     <!-- Same as STM32H753IIKx + ROMLess -->
          <algorithm name="CMSIS/Flash/STM32H7x_128k.FLM" start="0x08000000" size="0x00020000" default="1"/>

