saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
          <variant Dvariant="STM32H750IBKx"> <feature type="BGA" n="176"/> </variant>
        </device>

        <!-- *************************  Device 'STM32H750XB' ***************************** -->
        <device Dname="STM32H750XB">
          <memory    name="DTCMRAM"    id="IRAM1"         start="0x20000000" size="0x00020000" default="1" init="0"/>
          <memory    name="RAM_D1"     id="IRAM2"         start="0x24000000" size="0x00080000" default="1" init="0"/>
          <memory    name="RAM_D2"                        start="0x30000000" size="0x00048000" default="1" init="0"/>
          <memory    name="RAM_D3"                        start="0x38000000" size="0x00010000" default="1" init="0"/>
          <memory    name="ITCMRAM"                       start="0x00000000" size="0x00010000" default="1" init="0"/>
          <memory    name="FLASH"      id="IROM1"         start="0x08000000" size="0x00020000" default="1" startup="1"/>  <!-- Same as STM32H753XIHx + ROMLess -->
          <algorithm name="CMSIS/Flash/STM32H7x_128k.FLM" start="0x08000000" size="0x00020000" default="1"/>

          <variant Dvariant="STM32H750XBHx"> <feature type="BGA" n="240"/> </variant>
        </device>
      </subFamily>

    </family>

  </devices>

  <conditions>
    <!-- Core + Compiler Conditions -->
    <condition id="CM7_LE_ARMCC">
      <description>Cortex-M7 processor based device in little endian mode for the ARM Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7F_LE_ARMCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the ARM Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="CM7_LE_GCC">
      <description>Cortex-M7 processor based device in little endian mode for the GCC Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7F_LE_GCC">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the GCC Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="CM7_LE_IAR">
      <description>Cortex-M7 processor based device in little endian mode for the IAR Compiler</description>
      <require Dcore="Cortex-M7" Dfpu="NO_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="CM7F_LE_IAR">
      <description>Cortex-M7 processor based device using Floating Point Unit in little endian mode for the IAR Compiler</description>
      <accept Dcore="Cortex-M7" Dfpu="SP_FPU" Dendian="Little-endian"/>
      <accept Dcore="Cortex-M7" Dfpu="DP_FPU" Dendian="Little-endian"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device Conditions -->
    <condition id="STM32H7">
      <description>STMicroelectronics STM32H7 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H7*"/>
    </condition>
    <condition id="STM32H743">
      <description>STMicroelectronics STM32H743 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H743*"/>
    </condition>
    <condition id="STM32H753">
      <description>STMicroelectronics STM32H753 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H753*"/>
    </condition>
    <condition id="STM32H750">
      <description>STMicroelectronics STM32H750 Series devices</description>
      <require Dvendor="STMicroelectronics:13" Dname="STM32H750*"/>
    </condition>

    <!-- Device + Compiler Conditions -->
    <condition id="STM32H743_ARMCC">
      <description>filter for STM32H743 devices and the ARM compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H753_ARMCC">
      <description>filter for STM32H753 devices and the ARM compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="STM32H750_ARMCC">
      <description>filter for STM32H750 devices and the ARM compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="ARMCC"/>
    </condition>

    <condition id="STM32H743_GCC">
      <description>filter for STM32H743 devices and the GCC compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H753_GCC">
      <description>filter for STM32H753 devices and the GCC compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="GCC"/>
    </condition>
    <condition id="STM32H750_GCC">
      <description>filter for STM32H750 devices and the GCC compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="GCC"/>
    </condition>

    <condition id="STM32H743_IAR">
      <description>filter for STM32H743 devices and the IAR compiler</description>
      <require condition="STM32H743"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H753_IAR">
      <description>filter for STM32H753 devices and the IAR compiler</description>
      <require condition="STM32H753"/>
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="STM32H750_IAR">
      <description>filter for STM32H750 devices and the IAR compiler</description>
      <require condition="STM32H750"/>
      <require Tcompiler="IAR"/>
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="STM32H7 CMSIS">
      <description>STMicroelectronics STM32H7 Device and CMSIS-CORE</description>
      <require condition="STM32H7"/>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>

    <!-- HAL Conditions -->
    <condition id="STM32H7 HAL">
      <description>STMicroelectronics STM32H7 Device and HAL</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
    </condition>
    <condition id="STM32H7 HAL Common">
      <description>STMicroelectronics STM32H7 Device and HAL Common</description>
      <require condition="STM32H7"/>
      <require Cclass="CMSIS"  Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="STM32Cube Framework"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Cortex"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="RCC"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="PWR"/>
    </condition>
    <condition id="STM32H7 HAL GPIO">
      <description>STMicroelectronics STM32H7 Device and HAL with GPIO</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="GPIO"/>
    </condition>
    <condition id="STM32H7 HAL DMA">
      <description>STMicroelectronics STM32H7 Device and HAL with DMA</description>
      <require condition="STM32H7"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="Common"/>
      <require Cclass="Device" Cgroup="STM32Cube HAL" Csub="DMA"/>
    </condition>
