saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
    <component Cclass="Device" Cgroup="STM32Cube HAL" Csub="WWDG"      Cversion="1.3.0" condition="STM32H7 HAL">
      <description>Window watchdog (WWDG) HAL driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_HAL_WWDG
      </RTE_Components_h>
      <files>
        <file category="source" name="Drivers/STM32H7xx_HAL_Driver/Src/stm32h7xx_hal_wwdg.c"/>
      </files>
    </component>

    <!-- END: STMicroelectronics STM32CubeH7 HAL -->

    <!-- CMSIS drivers -->
    <component Cclass="CMSIS Driver" Cgroup="CAN" Capiversion="1.0.0" Cversion="1.1.0" condition="STM32H7 CMSIS_Driver CAN">
      <description>CAN Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_CAN1                /* Driver CAN1 */
        #define RTE_Drivers_CAN2                /* Driver CAN2 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/FDCAN_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="Ethernet MAC" Capiversion="2.1.0" Cversion="1.0.0" condition="STM32H7 CMSIS_Driver ETH">
      <description>Ethernet MAC Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_ETH_MAC0            /* Driver ETH_MAC0 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/EMAC_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Capiversion="2.2.0" Cversion="1.1.0" condition="STM32H7 CMSIS_Driver I2C">
      <description>I2C Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_I2C1                /* Driver I2C1 */
        #define RTE_Drivers_I2C2                /* Driver I2C2 */
        #define RTE_Drivers_I2C3                /* Driver I2C3 */
        #define RTE_Drivers_I2C4                /* Driver I2C4 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/I2C_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="MCI" Capiversion="2.2.0" Cversion="1.0.0" condition="STM32H7 CMSIS_Driver MCI">
      <description>MCI Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_MCI0                /* Driver MCI0 */
        #define RTE_Drivers_MCI1                /* Driver MCI1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/MCI_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI"          Capiversion="2.1.0" Cversion="1.1.0" condition="STM32H7 CMSIS_Driver SPI">
      <description>SPI Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_SPI1                /* Driver SPI1 */
        #define RTE_Drivers_SPI2                /* Driver SPI2 */
        #define RTE_Drivers_SPI3                /* Driver SPI3 */
        #define RTE_Drivers_SPI4                /* Driver SPI4 */
        #define RTE_Drivers_SPI5                /* Driver SPI5 */
        #define RTE_Drivers_SPI6                /* Driver SPI6 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/SPI_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART"        Capiversion="2.1.0" Cversion="1.1.0" condition="STM32H7 CMSIS_Driver USART">
      <description>USART Driver for STM32H7 Series</description>
      <RTE_Components_h>  <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_Drivers_USART1              /* Driver USART1 */
        #define RTE_Drivers_USART2              /* Driver USART2 */
        #define RTE_Drivers_USART3              /* Driver USART3 */
        #define RTE_Drivers_USART4              /* Driver USART4 */
        #define RTE_Drivers_USART5              /* Driver USART5 */
        #define RTE_Drivers_USART5              /* Driver USART6 */
        #define RTE_Drivers_USART5              /* Driver USART7 */
        #define RTE_Drivers_USART5              /* Driver USART8 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/UART_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USART_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/IrDA_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/SmartCard_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Device" Capiversion="2.1.0" Cversion="1.1.0" condition="STM32H7 CMSIS_Driver USBD">
      <description>USB Device Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBD0               /* Driver USBD0 */
        #define RTE_Drivers_USBD1               /* Driver USBD1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBD_STM32H7xx.c"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USB Host" Capiversion="2.1.0" Cversion="1.0.0" condition="STM32H7 CMSIS_Driver USBH">
      <description>USB Host Driver for STM32H7 Series</description>
      <RTE_Components_h>
        #define RTE_Drivers_USBH0               /* Driver USBH0 */
        #define RTE_Drivers_USBH1               /* Driver USBH1 */
      </RTE_Components_h>
      <files>
        <file category="source" name="CMSIS/Driver/OTG_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS1_STM32H7xx.c"/>
        <file category="source" name="CMSIS/Driver/USBH_HS2_STM32H7xx.c"/>
      </files>
    </component>

    <!-- STM32H743I-EVAL Board -->
    <bundle Cbundle="STM32H743I-EVAL" Cclass="Board Support" Cversion="1.1.0">
      <description>STMicroelectronics STM32H743I-EVAL Board</description>
      <doc>Drivers/BSP/STM32H743I_EVAL/STM32H743I_EVAL_BSP_User_Manual.chm</doc>
      <component Cgroup="Documentation" condition="STM32H7">
      <description>STM32H743I-EVAL BSP User Manual</description>
      <files>
        <file category="doc" name="Drivers/BSP/STM32H743I_EVAL/STM32H743I_EVAL_BSP_User_Manual.chm" />
      </files>
      </component>
