saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.STM32H7xx_DFP.2.2.0.pdsc
      <component Cgroup="Buttons"       Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO">
        <description>Buttons Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Buttons_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="A/D Converter" Capiversion="1.0.0"                   condition="STM32H7 HAL GPIO ADC">
        <description>A/D Converter Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/ADC_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Joystick"      Capiversion="1.0.0"                   condition="STM32H743I-EVAL Joystick">
        <description>Joystick Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Joystick_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Touchscreen"   Capiversion="1.0.0"                   condition="STM32H743I-EVAL TS">
        <description>Touchscreen Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Touch_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="Graphic LCD"   Capiversion="1.0.0"                   condition="STM32H743I-EVAL GLCD">
        <description>Graphic LCD interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="header" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_Config.h"/>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_Fonts.c"/>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/GLCD_743I_EVAL.c"/>
        </files>
      </component>
      <component Cgroup="emWin LCD"     Capiversion="1.1.0" Cvariant="RGB IF" condition="STM32H743I-EVAL LCD_RGB">
        <description>emWin LCD RGB Interface for STMicroelectronics STM32H743I-EVAL Board</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/LCD_X.c"/>
        </files>
      </component>
<!--
      <component Cgroup="Audio"         Capiversion="1.1.0" condition="STM32H7 CMSIS SAI and I2C Driver">
        <description>Audio interface for WM8994</description>
        <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/Audio_743I_EVAL.c"/>
        </files>
      </component>
-->
    </bundle>

    <component Cclass="Graphics Display" Cgroup="STM32H743I-EVAL" Cvariant="RGB IF" Cversion="1.0.1" condition="STM32H7 HAL LTDC DMA2D Graphics LCD_RGB">
      <description>LCD Configuration for STM32H743I-EVAL LCD</description>
      <files>
          <file category="source" name="MDK/Boards/ST/STM32H743I_EVAL/Common/LCDConf.c" attr="config" version="1.0.1"/>
      </files>
    </component>
  </components>

  <boards>
    <!-- STM32H743I-EVAL -->
    <board vendor="STMicroelectronics" name="STM32H743I-EVAL" revision="Rev.B" salesContact="http://www.st.com/stonline/contactus/contacts/index.php">
      <description>STMicroelectronics STM32H743I-EVAL Evaluation Board Support and Examples</description>
      <!--image small="MDK/Boards/ST/STM32H743I_EVAL/Documentation/stm32h743i-eval_small.jpg"
             large="MDK/Boards/ST/STM32H743I_EVAL/Documentation/stm32h743i-eval_large.jpg"/-->
      <book category="overview"  name="http://www.st.com/en/evaluation-tools/stm32h743i-eval.html" title="STM32H743I_EVAL Evaluation Board Web Page"/>
      <!--book category="manual"  name="Drivers/BSP/STM32H743I_EVAL/STM32H743I_EVAL_BSP_User_Manual.chm" title="BSP User Manual"/-->
      <!--book category="manual"    name="MDK/Boards/ST/STM32H743I_EVAL/Documentation/DM00276567.pdf" title="User Manual"/-->
      <!--book category="schematic" name="MDK/Boards/ST/STM32H743I_EVAL/Documentation/stm32f7x9i-eval_sch.zip" title="Schematics"/-->
      <book category="other"     name="MDK/Boards/ST/STM32H743I_EVAL/Documentation/stm32h743i-eval_gerber.zip" title="Gerber Files"/>
      <!--book category="other"     name="MDK/Boards/ST/STM32H743I_EVAL/Documentation/stm32f7x9i-eval_bom.zip" title="Bill of Materials"/-->
      <mountedDevice    deviceIndex="0" Dvendor="STMicroelectronics:13" Dname="STM32H743XI"/>
      <compatibleDevice deviceIndex="0" Dvendor="STMicroelectronics:13" DsubFamily="STM32H743"/>
      <feature type="ODbg"      n="1"              name="On-board ST-LINK/V2"/>
      <feature type="RAM"       n="1"              name="8M x 32-bit SDRAM"/>
      <feature type="RAM"       n="1"              name="1M x 16-bit SRAM"/>
      <feature type="ROM"       n="1"              name="8M x 16-bit Nor Flash"/>
      <feature type="ROM"       n="1"              name="512-Mbit Quad-SPI NOR Flash"/>
      <feature type="USB"       n="1"              name="High-Speed USB with micro-AB Connector"/>
      <feature type="USB"       n="2"              name="Full-Speed USB with micro-AB Connector"/>
      <feature type="Joystick"  n="1"              name="5-position Joystick"/>
      <feature type="Camera"    n="1"/>
      <feature type="Button"    n="2"              name="Push-Buttons for Reset, Wakeup/Tamper or Key"/>
      <feature type="LED"       n="4"              name="4 color user LEDs"/>
      <feature type="GLCD"      n="1"  m="800.480" name="4-inch 800x480 TFT color LCD with capacitive touch panel"/>
      <feature type="Poti"      n="1"              name="Analog Voltage Control for ADC Input (potentiometer)"/>
      <feature type="LineIn"    n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="LineOut"   n="1"              name="Audio CODEC with Stereo Line-In/Out and Speaker/Microphone"/>
      <feature type="MIC"       n="2"              name="ST MEMS microphones"/>
      <feature type="Speaker"   n="2"/>
      <feature type="Other"     n="1"              name="Digital Stereo Microphone"/>
      <feature type="CAN"       n="1"/>
      <feature type="RS232"     n="1"/>
      <feature type="I2C"       n="4"/>
      <feature type="ETH"       n="1"              name="10/100 Ethernet Port"/>
      <feature type="XTAL"      n="25000000"/>
      <feature type="PWR"       n="5"              name="USB Powered"/>
      <feature type="PWR"       n="3"  m="5"       name="External Supply"/>
      <feature type="MemCard"   n="1"              name="SDIO interface microSD card"/>
      <feature type="DIO"       n="34"             name="Motor Control Connector"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 1"/>
      <feature type="DIO"       n="60"             name="Daughterboard Extension header 2"/>
      <feature type="ConnOther" n="1"              name="Motor control connector"/>
      <debugInterface adapter="ST-Link" connector="Mini-USB"/>
      <debugInterface adapter="JTAG/SW" connector="20 pin JTAG (0.1 inch connector)"/>
      <debugInterface adapter="JTAG/SW" connector="20-pin Cortex debug + ETM Trace (0.05 inch connector)"/>
    </board>
  </boards>

  <examples>
    <!-- STM32H743I-EVAL Board -->
    <example name="CMSIS-RTOS2 Blinky" doc="Abstract.txt" folder="MDK/Boards/ST/STM32H743I_EVAL/Blinky">
      <description>CMSIS-RTOS2 Blinky example</description>
      <board name="STM32H743I-EVAL" vendor="STMicroelectronics"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

